---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound.NameKey
source: html/7d637ab4-daa8-fd49-96ea-25d70c6f78ce.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound.NameKey Property

Name Key

## Syntax (C#)
```csharp
public string NameKey { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null